; ModuleID = '<stdin>'
source_filename = "example1.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !2, file: !3, line: 74, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "std", scope: null)
!3 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/iostream", directory: "")
!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 626, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h", directory: "")
!6 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 228, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
!7 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !8, producer: "clang version 14.0.0 (https://github.com/HPSSA-LLVM/llvm-project.git a556ec8861df920bfaee3057df8aac739aa59b24)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !20, globals: !27, imports: !28, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "example1.cpp", directory: "/home/clustfuzz/Documents/LLVM/LLVM-Examples/LLVMIRModify")
!9 = !{!10}
!10 = distinct !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Iostate", scope: !2, file: !5, line: 153, baseType: !11, size: 32, elements: !12, identifier: "_ZTSSt12_Ios_Iostate")
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!13, !14, !15, !16, !17, !18, !19}
!13 = !DIEnumerator(name: "_S_goodbit", value: 0)
!14 = !DIEnumerator(name: "_S_badbit", value: 1)
!15 = !DIEnumerator(name: "_S_eofbit", value: 2)
!16 = !DIEnumerator(name: "_S_failbit", value: 4)
!17 = !DIEnumerator(name: "_S_ios_iostate_end", value: 65536)
!18 = !DIEnumerator(name: "_S_ios_iostate_max", value: 2147483647)
!19 = !DIEnumerator(name: "_S_ios_iostate_min", value: -2147483648)
!20 = !{!21, !10, !11, !26, !6}
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !2, file: !22, line: 98, baseType: !23)
!22 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/postypes.h", directory: "")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !2, file: !24, line: 265, baseType: !25)
!24 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h", directory: "")
!25 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !{!0}
!28 = !{!29, !48, !51, !56, !120, !128, !132, !139, !143, !147, !149, !151, !155, !164, !168, !174, !180, !182, !186, !190, !194, !198, !209, !211, !215, !219, !223, !225, !230, !234, !238, !240, !242, !246, !254, !258, !262, !266, !268, !274, !276, !283, !288, !292, !296, !300, !304, !308, !310, !312, !316, !320, !324, !326, !330, !334, !336, !338, !342, !348, !353, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !372, !376, !380, !385, !389, !392, !395, !398, !400, !402, !404, !407, !410, !413, !416, !419, !421, !425, !428, !431, !434, !436, !438, !440, !442, !445, !448, !451, !454, !457, !459, !463, !467, !472, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !508, !512, !518, !522, !527, !529, !534, !538, !542, !553, !557, !561, !565, !569, !573, !577, !581, !585, !589, !593, !597, !601, !603, !607, !611, !615, !621, !625, !629, !631, !635, !639, !645, !647, !651, !655, !659, !663, !667, !671, !675, !676, !677, !678, !680, !681, !682, !683, !684, !685, !686, !690, !696, !701, !705, !707, !709, !711, !713, !720, !724, !728, !732, !736, !740, !745, !749, !751, !755, !761, !765, !770, !772, !775, !779, !783, !785, !787, !789, !791, !795, !797, !799, !803, !807, !811, !815, !819, !823, !825, !829, !833, !837, !841, !843, !845, !849, !853, !854, !855, !856, !857, !858, !864, !867, !868, !870, !872, !874, !876, !880, !882, !884, !886, !888, !890, !892, !894, !896, !900, !904, !906, !910}
!29 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !30, file: !47, line: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !31, line: 6, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !33, line: 21, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !35, identifier: "_ZTS11__mbstate_t")
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !34, file: !33, line: 15, baseType: !11, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !34, file: !33, line: 20, baseType: !38, size: 32, offset: 32)
!38 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !33, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !39, identifier: "_ZTSN11__mbstate_tUt_E")
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !38, file: !33, line: 18, baseType: !41, size: 32)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !38, file: !33, line: 19, baseType: !43, size: 32)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !45)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !{!46}
!46 = !DISubrange(count: 4)
!47 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cwchar", directory: "")
!48 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !49, file: !47, line: 141)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !50, line: 20, baseType: !41)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!51 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !52, file: !47, line: 143)
!52 = !DISubprogram(name: "btowc", scope: !53, file: !53, line: 318, type: !54, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!53 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!54 = !DISubroutineType(types: !55)
!55 = !{!49, !11}
!56 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !57, file: !47, line: 144)
!57 = !DISubprogram(name: "fgetwc", scope: !53, file: !53, line: 726, type: !58, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!58 = !DISubroutineType(types: !59)
!59 = !{!49, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !62, line: 5, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !65, identifier: "_ZTS8_IO_FILE")
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!65 = !{!66, !67, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !82, !84, !85, !86, !89, !91, !93, !97, !100, !102, !105, !108, !109, !111, !115, !116}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 51, baseType: !11, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 54, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 55, baseType: !68, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 56, baseType: !68, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 57, baseType: !68, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 58, baseType: !68, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 59, baseType: !68, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 60, baseType: !68, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 61, baseType: !68, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 64, baseType: !68, size: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 65, baseType: !68, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 66, baseType: !68, size: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 68, baseType: !80, size: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 70, baseType: !83, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 72, baseType: !11, size: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 73, baseType: !11, size: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 74, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !88, line: 152, baseType: !25)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 77, baseType: !90, size: 16, offset: 1024)
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 78, baseType: !92, size: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 79, baseType: !94, size: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 81, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 43, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 89, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !88, line: 153, baseType: !25)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !63, file: !64, line: 91, baseType: !103, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !64, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !63, file: !64, line: 92, baseType: !106, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !64, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !63, file: !64, line: 93, baseType: !83, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !63, file: !64, line: 94, baseType: !110, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 95, baseType: !112, size: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "llvm-project/build/lib/clang/14.0.0/include/stddef.h", directory: "/home/clustfuzz")
!114 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 96, baseType: !11, size: 32, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 98, baseType: !117, size: 160, offset: 1568)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 20)
!120 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !121, file: !47, line: 145)
!121 = !DISubprogram(name: "fgetws", scope: !53, file: !53, line: 755, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !126, !11, !127}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !124)
!127 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!128 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !129, file: !47, line: 146)
!129 = !DISubprogram(name: "fputwc", scope: !53, file: !53, line: 740, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{!49, !125, !60}
!132 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !133, file: !47, line: 147)
!133 = !DISubprogram(name: "fputws", scope: !53, file: !53, line: 762, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!134 = !DISubroutineType(types: !135)
!135 = !{!11, !136, !127}
!136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !140, file: !47, line: 148)
!140 = !DISubprogram(name: "fwide", scope: !53, file: !53, line: 573, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!141 = !DISubroutineType(types: !142)
!142 = !{!11, !60, !11}
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !144, file: !47, line: 149)
!144 = !DISubprogram(name: "fwprintf", scope: !53, file: !53, line: 580, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!145 = !DISubroutineType(types: !146)
!146 = !{!11, !127, !136, null}
!147 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !148, file: !47, line: 150)
!148 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !53, file: !53, line: 640, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!149 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !150, file: !47, line: 151)
!150 = !DISubprogram(name: "getwc", scope: !53, file: !53, line: 727, type: !58, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!151 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !152, file: !47, line: 152)
!152 = !DISubprogram(name: "getwchar", scope: !53, file: !53, line: 733, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!153 = !DISubroutineType(types: !154)
!154 = !{!49}
!155 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !156, file: !47, line: 153)
!156 = !DISubprogram(name: "mbrlen", scope: !53, file: !53, line: 329, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!157 = !DISubroutineType(types: !158)
!158 = !{!112, !159, !112, !162}
!159 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!162 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !165, file: !47, line: 154)
!165 = !DISubprogram(name: "mbrtowc", scope: !53, file: !53, line: 296, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!166 = !DISubroutineType(types: !167)
!167 = !{!112, !126, !159, !112, !162}
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !169, file: !47, line: 155)
!169 = !DISubprogram(name: "mbsinit", scope: !53, file: !53, line: 292, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{!11, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !175, file: !47, line: 156)
!175 = !DISubprogram(name: "mbsrtowcs", scope: !53, file: !53, line: 337, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{!112, !126, !178, !112, !162}
!178 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !181, file: !47, line: 157)
!181 = !DISubprogram(name: "putwc", scope: !53, file: !53, line: 741, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !183, file: !47, line: 158)
!183 = !DISubprogram(name: "putwchar", scope: !53, file: !53, line: 747, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!184 = !DISubroutineType(types: !185)
!185 = !{!49, !125}
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !187, file: !47, line: 160)
!187 = !DISubprogram(name: "swprintf", scope: !53, file: !53, line: 590, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!188 = !DISubroutineType(types: !189)
!189 = !{!11, !126, !112, !136, null}
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !191, file: !47, line: 162)
!191 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !53, file: !53, line: 647, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!192 = !DISubroutineType(types: !193)
!193 = !{!11, !136, !136, null}
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !195, file: !47, line: 163)
!195 = !DISubprogram(name: "ungetwc", scope: !53, file: !53, line: 770, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!196 = !DISubroutineType(types: !197)
!197 = !{!49, !49, !60}
!198 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !199, file: !47, line: 164)
!199 = !DISubprogram(name: "vfwprintf", scope: !53, file: !53, line: 598, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{!11, !127, !136, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !204, identifier: "_ZTS13__va_list_tag")
!204 = !{!205, !206, !207, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !203, file: !8, baseType: !41, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !203, file: !8, baseType: !41, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !203, file: !8, baseType: !110, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !203, file: !8, baseType: !110, size: 64, offset: 128)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !210, file: !47, line: 166)
!210 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !53, file: !53, line: 693, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !212, file: !47, line: 169)
!212 = !DISubprogram(name: "vswprintf", scope: !53, file: !53, line: 611, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{!11, !126, !112, !136, !202}
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !216, file: !47, line: 172)
!216 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !53, file: !53, line: 700, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubroutineType(types: !218)
!218 = !{!11, !136, !136, !202}
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !220, file: !47, line: 174)
!220 = !DISubprogram(name: "vwprintf", scope: !53, file: !53, line: 606, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubroutineType(types: !222)
!222 = !{!11, !136, !202}
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !224, file: !47, line: 176)
!224 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !53, file: !53, line: 697, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !226, file: !47, line: 178)
!226 = !DISubprogram(name: "wcrtomb", scope: !53, file: !53, line: 301, type: !227, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!227 = !DISubroutineType(types: !228)
!228 = !{!112, !229, !125, !162}
!229 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !231, file: !47, line: 179)
!231 = !DISubprogram(name: "wcscat", scope: !53, file: !53, line: 97, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubroutineType(types: !233)
!233 = !{!124, !126, !136}
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !235, file: !47, line: 180)
!235 = !DISubprogram(name: "wcscmp", scope: !53, file: !53, line: 106, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!236 = !DISubroutineType(types: !237)
!237 = !{!11, !137, !137}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !239, file: !47, line: 181)
!239 = !DISubprogram(name: "wcscoll", scope: !53, file: !53, line: 131, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !241, file: !47, line: 182)
!241 = !DISubprogram(name: "wcscpy", scope: !53, file: !53, line: 87, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !243, file: !47, line: 183)
!243 = !DISubprogram(name: "wcscspn", scope: !53, file: !53, line: 187, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!244 = !DISubroutineType(types: !245)
!245 = !{!112, !137, !137}
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !247, file: !47, line: 184)
!247 = !DISubprogram(name: "wcsftime", scope: !53, file: !53, line: 834, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!248 = !DISubroutineType(types: !249)
!249 = !{!112, !126, !112, !136, !250}
!250 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !53, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !255, file: !47, line: 185)
!255 = !DISubprogram(name: "wcslen", scope: !53, file: !53, line: 222, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!112, !137}
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !259, file: !47, line: 186)
!259 = !DISubprogram(name: "wcsncat", scope: !53, file: !53, line: 101, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DISubroutineType(types: !261)
!261 = !{!124, !126, !136, !112}
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !263, file: !47, line: 187)
!263 = !DISubprogram(name: "wcsncmp", scope: !53, file: !53, line: 109, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!11, !137, !137, !112}
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !267, file: !47, line: 188)
!267 = !DISubprogram(name: "wcsncpy", scope: !53, file: !53, line: 92, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !269, file: !47, line: 189)
!269 = !DISubprogram(name: "wcsrtombs", scope: !53, file: !53, line: 343, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!270 = !DISubroutineType(types: !271)
!271 = !{!112, !229, !272, !112, !162}
!272 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !275, file: !47, line: 190)
!275 = !DISubprogram(name: "wcsspn", scope: !53, file: !53, line: 191, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !277, file: !47, line: 191)
!277 = !DISubprogram(name: "wcstod", scope: !53, file: !53, line: 377, type: !278, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !136, !281}
!280 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!281 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !284, file: !47, line: 193)
!284 = !DISubprogram(name: "wcstof", scope: !53, file: !53, line: 382, type: !285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !136, !281}
!287 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !289, file: !47, line: 195)
!289 = !DISubprogram(name: "wcstok", scope: !53, file: !53, line: 217, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!290 = !DISubroutineType(types: !291)
!291 = !{!124, !126, !136, !281}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !293, file: !47, line: 196)
!293 = !DISubprogram(name: "wcstol", scope: !53, file: !53, line: 428, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!25, !136, !281, !11}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !297, file: !47, line: 197)
!297 = !DISubprogram(name: "wcstoul", scope: !53, file: !53, line: 433, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{!114, !136, !281, !11}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !301, file: !47, line: 198)
!301 = !DISubprogram(name: "wcsxfrm", scope: !53, file: !53, line: 135, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DISubroutineType(types: !303)
!303 = !{!112, !126, !136, !112}
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !305, file: !47, line: 199)
!305 = !DISubprogram(name: "wctob", scope: !53, file: !53, line: 324, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DISubroutineType(types: !307)
!307 = !{!11, !49}
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !309, file: !47, line: 200)
!309 = !DISubprogram(name: "wmemcmp", scope: !53, file: !53, line: 258, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !311, file: !47, line: 201)
!311 = !DISubprogram(name: "wmemcpy", scope: !53, file: !53, line: 262, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !313, file: !47, line: 202)
!313 = !DISubprogram(name: "wmemmove", scope: !53, file: !53, line: 267, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{!124, !124, !137, !112}
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !317, file: !47, line: 203)
!317 = !DISubprogram(name: "wmemset", scope: !53, file: !53, line: 271, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{!124, !124, !125, !112}
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !321, file: !47, line: 204)
!321 = !DISubprogram(name: "wprintf", scope: !53, file: !53, line: 587, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DISubroutineType(types: !323)
!323 = !{!11, !136, null}
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !47, line: 205)
!325 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !53, file: !53, line: 644, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !327, file: !47, line: 206)
!327 = !DISubprogram(name: "wcschr", scope: !53, file: !53, line: 164, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DISubroutineType(types: !329)
!329 = !{!124, !137, !125}
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !331, file: !47, line: 207)
!331 = !DISubprogram(name: "wcspbrk", scope: !53, file: !53, line: 201, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!332 = !DISubroutineType(types: !333)
!333 = !{!124, !137, !137}
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !335, file: !47, line: 208)
!335 = !DISubprogram(name: "wcsrchr", scope: !53, file: !53, line: 174, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !337, file: !47, line: 209)
!337 = !DISubprogram(name: "wcsstr", scope: !53, file: !53, line: 212, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !339, file: !47, line: 210)
!339 = !DISubprogram(name: "wmemchr", scope: !53, file: !53, line: 253, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DISubroutineType(types: !341)
!341 = !{!124, !137, !125, !112}
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !344, file: !47, line: 251)
!343 = !DINamespace(name: "__gnu_cxx", scope: null)
!344 = !DISubprogram(name: "wcstold", scope: !53, file: !53, line: 384, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !136, !281}
!347 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !349, file: !47, line: 260)
!349 = !DISubprogram(name: "wcstoll", scope: !53, file: !53, line: 441, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DISubroutineType(types: !351)
!351 = !{!352, !136, !281, !11}
!352 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !354, file: !47, line: 261)
!354 = !DISubprogram(name: "wcstoull", scope: !53, file: !53, line: 448, type: !355, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !136, !281, !11}
!357 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !344, file: !47, line: 267)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !349, file: !47, line: 268)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !354, file: !47, line: 269)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !284, file: !47, line: 283)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !210, file: !47, line: 286)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !216, file: !47, line: 289)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !224, file: !47, line: 292)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !344, file: !47, line: 296)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !349, file: !47, line: 297)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !354, file: !47, line: 298)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !369, file: !370, line: 58)
!369 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !371, file: !370, line: 80, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!370 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/exception_ptr.h", directory: "")
!371 = !DINamespace(name: "__exception_ptr", scope: !2)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !371, entity: !373, file: !370, line: 74)
!373 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !370, line: 70, type: !374, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !369}
!376 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !377, entity: !378, file: !379, line: 58)
!377 = !DINamespace(name: "__gnu_debug", scope: null)
!378 = !DINamespace(name: "__debug", scope: !2)
!379 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !381, file: !384, line: 47)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !382, line: 24, baseType: !383)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !88, line: 37, baseType: !92)
!384 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdint", directory: "")
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !386, file: !384, line: 48)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !382, line: 25, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !88, line: 39, baseType: !388)
!388 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !390, file: !384, line: 49)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !382, line: 26, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !88, line: 41, baseType: !11)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !393, file: !384, line: 50)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !382, line: 27, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !88, line: 44, baseType: !25)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !396, file: !384, line: 52)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !397, line: 58, baseType: !92)
!397 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !399, file: !384, line: 53)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !397, line: 60, baseType: !25)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !401, file: !384, line: 54)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !397, line: 61, baseType: !25)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !403, file: !384, line: 55)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !397, line: 62, baseType: !25)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !405, file: !384, line: 57)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !397, line: 43, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !88, line: 52, baseType: !383)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !408, file: !384, line: 58)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !397, line: 44, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !88, line: 54, baseType: !387)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !384, line: 59)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !397, line: 45, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !88, line: 56, baseType: !391)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !414, file: !384, line: 60)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !397, line: 46, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !88, line: 58, baseType: !394)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !384, line: 62)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !397, line: 101, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !88, line: 72, baseType: !25)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !420, file: !384, line: 63)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !397, line: 87, baseType: !25)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !422, file: !384, line: 65)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !423, line: 24, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !88, line: 38, baseType: !26)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !426, file: !384, line: 66)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !423, line: 25, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !88, line: 40, baseType: !90)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !429, file: !384, line: 67)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !423, line: 26, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !88, line: 42, baseType: !41)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !432, file: !384, line: 68)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !423, line: 27, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !88, line: 45, baseType: !114)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !435, file: !384, line: 70)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !397, line: 71, baseType: !26)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !437, file: !384, line: 71)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !397, line: 73, baseType: !114)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !439, file: !384, line: 72)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !397, line: 74, baseType: !114)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !441, file: !384, line: 73)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !397, line: 75, baseType: !114)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !443, file: !384, line: 75)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !397, line: 49, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !88, line: 53, baseType: !424)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !446, file: !384, line: 76)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !397, line: 50, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !88, line: 55, baseType: !427)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !449, file: !384, line: 77)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !397, line: 51, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !88, line: 57, baseType: !430)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !452, file: !384, line: 78)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !397, line: 52, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !88, line: 59, baseType: !433)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !455, file: !384, line: 80)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !397, line: 102, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !88, line: 73, baseType: !114)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !458, file: !384, line: 81)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !397, line: 90, baseType: !114)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !460, file: !462, line: 53)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !461, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!461 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!462 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/clocale", directory: "")
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !464, file: !462, line: 54)
!464 = !DISubprogram(name: "setlocale", scope: !461, file: !461, line: 122, type: !465, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!465 = !DISubroutineType(types: !466)
!466 = !{!68, !11, !160}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !468, file: !462, line: 55)
!468 = !DISubprogram(name: "localeconv", scope: !461, file: !461, line: 125, type: !469, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!469 = !DISubroutineType(types: !470)
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !473, file: !477, line: 64)
!473 = !DISubprogram(name: "isalnum", scope: !474, file: !474, line: 108, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!474 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!475 = !DISubroutineType(types: !476)
!476 = !{!11, !11}
!477 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !479, file: !477, line: 65)
!479 = !DISubprogram(name: "isalpha", scope: !474, file: !474, line: 109, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !481, file: !477, line: 66)
!481 = !DISubprogram(name: "iscntrl", scope: !474, file: !474, line: 110, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !483, file: !477, line: 67)
!483 = !DISubprogram(name: "isdigit", scope: !474, file: !474, line: 111, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !485, file: !477, line: 68)
!485 = !DISubprogram(name: "isgraph", scope: !474, file: !474, line: 113, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !487, file: !477, line: 69)
!487 = !DISubprogram(name: "islower", scope: !474, file: !474, line: 112, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !489, file: !477, line: 70)
!489 = !DISubprogram(name: "isprint", scope: !474, file: !474, line: 114, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !491, file: !477, line: 71)
!491 = !DISubprogram(name: "ispunct", scope: !474, file: !474, line: 115, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !493, file: !477, line: 72)
!493 = !DISubprogram(name: "isspace", scope: !474, file: !474, line: 116, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !495, file: !477, line: 73)
!495 = !DISubprogram(name: "isupper", scope: !474, file: !474, line: 117, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !497, file: !477, line: 74)
!497 = !DISubprogram(name: "isxdigit", scope: !474, file: !474, line: 118, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !499, file: !477, line: 75)
!499 = !DISubprogram(name: "tolower", scope: !474, file: !474, line: 122, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !501, file: !477, line: 76)
!501 = !DISubprogram(name: "toupper", scope: !474, file: !474, line: 125, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !503, file: !477, line: 87)
!503 = !DISubprogram(name: "isblank", scope: !474, file: !474, line: 130, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !505, file: !507, line: 52)
!505 = !DISubprogram(name: "abs", scope: !506, file: !506, line: 840, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!506 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!507 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !509, file: !511, line: 127)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !506, line: 62, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!511 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !513, file: !511, line: 128)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !506, line: 70, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !515, identifier: "_ZTS6ldiv_t")
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !514, file: !506, line: 68, baseType: !25, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !514, file: !506, line: 69, baseType: !25, size: 64, offset: 64)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !519, file: !511, line: 130)
!519 = !DISubprogram(name: "abort", scope: !506, file: !506, line: 591, type: !520, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{null}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !523, file: !511, line: 134)
!523 = !DISubprogram(name: "atexit", scope: !506, file: !506, line: 595, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!11, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !528, file: !511, line: 137)
!528 = !DISubprogram(name: "at_quick_exit", scope: !506, file: !506, line: 600, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !530, file: !511, line: 140)
!530 = !DISubprogram(name: "atof", scope: !531, file: !531, line: 25, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!532 = !DISubroutineType(types: !533)
!533 = !{!280, !160}
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !535, file: !511, line: 141)
!535 = !DISubprogram(name: "atoi", scope: !506, file: !506, line: 361, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!536 = !DISubroutineType(types: !537)
!537 = !{!11, !160}
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !539, file: !511, line: 142)
!539 = !DISubprogram(name: "atol", scope: !506, file: !506, line: 366, type: !540, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DISubroutineType(types: !541)
!541 = !{!25, !160}
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !543, file: !511, line: 143)
!543 = !DISubprogram(name: "bsearch", scope: !544, file: !544, line: 20, type: !545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!545 = !DISubroutineType(types: !546)
!546 = !{!110, !547, !547, !112, !112, !549}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !506, line: 808, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!11, !547, !547}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !554, file: !511, line: 144)
!554 = !DISubprogram(name: "calloc", scope: !506, file: !506, line: 542, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubroutineType(types: !556)
!556 = !{!110, !112, !112}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !558, file: !511, line: 145)
!558 = !DISubprogram(name: "div", scope: !506, file: !506, line: 852, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!559 = !DISubroutineType(types: !560)
!560 = !{!509, !11, !11}
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !562, file: !511, line: 146)
!562 = !DISubprogram(name: "exit", scope: !506, file: !506, line: 617, type: !563, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !11}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !566, file: !511, line: 147)
!566 = !DISubprogram(name: "free", scope: !506, file: !506, line: 565, type: !567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !110}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !570, file: !511, line: 148)
!570 = !DISubprogram(name: "getenv", scope: !506, file: !506, line: 634, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubroutineType(types: !572)
!572 = !{!68, !160}
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !574, file: !511, line: 149)
!574 = !DISubprogram(name: "labs", scope: !506, file: !506, line: 841, type: !575, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !DISubroutineType(types: !576)
!576 = !{!25, !25}
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !578, file: !511, line: 150)
!578 = !DISubprogram(name: "ldiv", scope: !506, file: !506, line: 854, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubroutineType(types: !580)
!580 = !{!513, !25, !25}
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !582, file: !511, line: 151)
!582 = !DISubprogram(name: "malloc", scope: !506, file: !506, line: 539, type: !583, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubroutineType(types: !584)
!584 = !{!110, !112}
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !586, file: !511, line: 153)
!586 = !DISubprogram(name: "mblen", scope: !506, file: !506, line: 922, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DISubroutineType(types: !588)
!588 = !{!11, !160, !112}
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !590, file: !511, line: 154)
!590 = !DISubprogram(name: "mbstowcs", scope: !506, file: !506, line: 933, type: !591, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!591 = !DISubroutineType(types: !592)
!592 = !{!112, !126, !159, !112}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !594, file: !511, line: 155)
!594 = !DISubprogram(name: "mbtowc", scope: !506, file: !506, line: 925, type: !595, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!595 = !DISubroutineType(types: !596)
!596 = !{!11, !126, !159, !112}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !598, file: !511, line: 157)
!598 = !DISubprogram(name: "qsort", scope: !506, file: !506, line: 830, type: !599, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !110, !112, !112, !549}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !602, file: !511, line: 160)
!602 = !DISubprogram(name: "quick_exit", scope: !506, file: !506, line: 623, type: !563, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !604, file: !511, line: 163)
!604 = !DISubprogram(name: "rand", scope: !506, file: !506, line: 453, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!605 = !DISubroutineType(types: !606)
!606 = !{!11}
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !608, file: !511, line: 164)
!608 = !DISubprogram(name: "realloc", scope: !506, file: !506, line: 550, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!609 = !DISubroutineType(types: !610)
!610 = !{!110, !110, !112}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !612, file: !511, line: 165)
!612 = !DISubprogram(name: "srand", scope: !506, file: !506, line: 455, type: !613, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !41}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !616, file: !511, line: 166)
!616 = !DISubprogram(name: "strtod", scope: !506, file: !506, line: 117, type: !617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DISubroutineType(types: !618)
!618 = !{!280, !159, !619}
!619 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !622, file: !511, line: 167)
!622 = !DISubprogram(name: "strtol", scope: !506, file: !506, line: 176, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubroutineType(types: !624)
!624 = !{!25, !159, !619, !11}
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !626, file: !511, line: 168)
!626 = !DISubprogram(name: "strtoul", scope: !506, file: !506, line: 180, type: !627, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!627 = !DISubroutineType(types: !628)
!628 = !{!114, !159, !619, !11}
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !630, file: !511, line: 169)
!630 = !DISubprogram(name: "system", scope: !506, file: !506, line: 784, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !632, file: !511, line: 171)
!632 = !DISubprogram(name: "wcstombs", scope: !506, file: !506, line: 936, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!633 = !DISubroutineType(types: !634)
!634 = !{!112, !229, !136, !112}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !636, file: !511, line: 172)
!636 = !DISubprogram(name: "wctomb", scope: !506, file: !506, line: 929, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!637 = !DISubroutineType(types: !638)
!638 = !{!11, !68, !125}
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !640, file: !511, line: 200)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !506, line: 80, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !642, identifier: "_ZTS7lldiv_t")
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !641, file: !506, line: 78, baseType: !352, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !641, file: !506, line: 79, baseType: !352, size: 64, offset: 64)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !646, file: !511, line: 206)
!646 = !DISubprogram(name: "_Exit", scope: !506, file: !506, line: 629, type: !563, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !648, file: !511, line: 210)
!648 = !DISubprogram(name: "llabs", scope: !506, file: !506, line: 844, type: !649, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!649 = !DISubroutineType(types: !650)
!650 = !{!352, !352}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !652, file: !511, line: 216)
!652 = !DISubprogram(name: "lldiv", scope: !506, file: !506, line: 858, type: !653, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!653 = !DISubroutineType(types: !654)
!654 = !{!640, !352, !352}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !656, file: !511, line: 227)
!656 = !DISubprogram(name: "atoll", scope: !506, file: !506, line: 373, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!657 = !DISubroutineType(types: !658)
!658 = !{!352, !160}
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !660, file: !511, line: 228)
!660 = !DISubprogram(name: "strtoll", scope: !506, file: !506, line: 200, type: !661, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!661 = !DISubroutineType(types: !662)
!662 = !{!352, !159, !619, !11}
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !664, file: !511, line: 229)
!664 = !DISubprogram(name: "strtoull", scope: !506, file: !506, line: 205, type: !665, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!665 = !DISubroutineType(types: !666)
!666 = !{!357, !159, !619, !11}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !668, file: !511, line: 231)
!668 = !DISubprogram(name: "strtof", scope: !506, file: !506, line: 123, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!669 = !DISubroutineType(types: !670)
!670 = !{!287, !159, !619}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !343, entity: !672, file: !511, line: 232)
!672 = !DISubprogram(name: "strtold", scope: !506, file: !506, line: 126, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!673 = !DISubroutineType(types: !674)
!674 = !{!347, !159, !619}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !640, file: !511, line: 240)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !646, file: !511, line: 242)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !648, file: !511, line: 244)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !679, file: !511, line: 245)
!679 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !343, file: !511, line: 213, type: !653, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !652, file: !511, line: 246)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !656, file: !511, line: 248)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !668, file: !511, line: 249)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !660, file: !511, line: 250)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !664, file: !511, line: 251)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !672, file: !511, line: 252)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !687, file: !689, line: 98)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !688, line: 7, baseType: !63)
