; ModuleID = 'example1.bc'
source_filename = "example1.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !2, file: !3, line: 74, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "std", scope: null)
!3 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/iostream", directory: "")
!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 626, size: 8, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/ios_base.h", directory: "")
!6 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 228, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
!7 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !8, producer: "clang version 14.0.0 (https://github.com/HPSSA-LLVM/llvm-project.git ad890aa2327feb6b6aee676fe85b2352fba2403e)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !9, globals: !11, imports: !12, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "example1.cpp", directory: "/home/zcluster55/llvm-examples/LLVM-Examples/NewPMExample")
!9 = !{!10}
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!0}
!12 = !{!13, !33, !36, !41, !106, !114, !118, !125, !129, !133, !135, !137, !141, !150, !154, !160, !166, !168, !172, !176, !180, !184, !195, !197, !201, !205, !209, !211, !216, !220, !224, !226, !228, !232, !240, !244, !248, !252, !254, !260, !262, !269, !274, !278, !282, !286, !290, !294, !296, !298, !302, !306, !310, !312, !316, !320, !322, !324, !328, !334, !339, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !358, !362, !366, !371, !375, !378, !381, !384, !386, !388, !390, !393, !396, !399, !402, !405, !407, !411, !414, !417, !420, !422, !424, !426, !428, !431, !434, !437, !440, !443, !445, !449, !453, !458, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !494, !498, !504, !508, !513, !515, !520, !524, !528, !539, !543, !547, !551, !555, !559, !563, !567, !571, !575, !579, !583, !587, !589, !593, !597, !601, !607, !611, !615, !617, !621, !625, !631, !633, !637, !641, !645, !649, !653, !657, !661, !662, !663, !664, !666, !667, !668, !669, !670, !671, !672, !676, !682, !687, !691, !693, !695, !697, !699, !706, !710, !714, !718, !722, !726, !731, !735, !737, !741, !747, !751, !756, !758, !761, !765, !769, !771, !773, !775, !777, !781, !783, !785, !789, !793, !797, !801, !805, !809, !811, !815, !819, !823, !827, !829, !831, !835, !839, !840, !841, !842, !843, !844, !850, !853, !854, !856, !858, !860, !862, !866, !868, !870, !872, !874, !876, !878, !880, !882, !886, !890, !892, !896}
!13 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !14, file: !32, line: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !15, line: 6, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !19, identifier: "_ZTS11__mbstate_t")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !18, file: !17, line: 15, baseType: !21, size: 32)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !18, file: !17, line: 20, baseType: !23, size: 32, offset: 32)
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !18, file: !17, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !24, identifier: "_ZTSN11__mbstate_tUt_E")
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !23, file: !17, line: 18, baseType: !26, size: 32)
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !23, file: !17, line: 19, baseType: !28, size: 32)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, elements: !30)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !{!31}
!31 = !DISubrange(count: 4)
!32 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cwchar", directory: "")
!33 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !34, file: !32, line: 141)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !35, line: 20, baseType: !26)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!36 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !37, file: !32, line: 143)
!37 = !DISubprogram(name: "btowc", scope: !38, file: !38, line: 318, type: !39, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!38 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!34, !21}
!41 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !42, file: !32, line: 144)
!42 = !DISubprogram(name: "fgetwc", scope: !38, file: !38, line: 726, type: !43, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!43 = !DISubroutineType(types: !44)
!44 = !{!34, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !47, line: 5, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !49, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !50, identifier: "_ZTS8_IO_FILE")
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!50 = !{!51, !52, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !67, !69, !70, !71, !75, !77, !79, !83, !86, !88, !91, !94, !95, !97, !101, !102}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !49, line: 51, baseType: !21, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !48, file: !49, line: 54, baseType: !53, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !48, file: !49, line: 55, baseType: !53, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !48, file: !49, line: 56, baseType: !53, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !48, file: !49, line: 57, baseType: !53, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !48, file: !49, line: 58, baseType: !53, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !48, file: !49, line: 59, baseType: !53, size: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !48, file: !49, line: 60, baseType: !53, size: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !48, file: !49, line: 61, baseType: !53, size: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !48, file: !49, line: 64, baseType: !53, size: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !48, file: !49, line: 65, baseType: !53, size: 64, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !48, file: !49, line: 66, baseType: !53, size: 64, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !48, file: !49, line: 68, baseType: !65, size: 64, offset: 768)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !49, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !48, file: !49, line: 70, baseType: !68, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !48, file: !49, line: 72, baseType: !21, size: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !48, file: !49, line: 73, baseType: !21, size: 32, offset: 928)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !48, file: !49, line: 74, baseType: !72, size: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 152, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!74 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !48, file: !49, line: 77, baseType: !76, size: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !48, file: !49, line: 78, baseType: !78, size: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !48, file: !49, line: 79, baseType: !80, size: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !48, file: !49, line: 81, baseType: !84, size: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !49, line: 43, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !49, line: 89, baseType: !87, size: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 153, baseType: !74)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !48, file: !49, line: 91, baseType: !89, size: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !49, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !48, file: !49, line: 92, baseType: !92, size: 64, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !49, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !48, file: !49, line: 93, baseType: !68, size: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !48, file: !49, line: 94, baseType: !96, size: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !48, file: !49, line: 95, baseType: !98, size: 64, offset: 1472)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 46, baseType: !100)
!99 = !DIFile(filename: "/usr/local/lib/clang/14.0.0/include/stddef.h", directory: "")
!100 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !48, file: !49, line: 96, baseType: !21, size: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !48, file: !49, line: 98, baseType: !103, size: 160, offset: 1568)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 20)
!106 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !107, file: !32, line: 145)
!107 = !DISubprogram(name: "fgetws", scope: !38, file: !38, line: 755, type: !108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !112, !21, !113}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !110)
!113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!114 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !115, file: !32, line: 146)
!115 = !DISubprogram(name: "fputwc", scope: !38, file: !38, line: 740, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!116 = !DISubroutineType(types: !117)
!117 = !{!34, !111, !45}
!118 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !119, file: !32, line: 147)
!119 = !DISubprogram(name: "fputws", scope: !38, file: !38, line: 762, type: !120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!120 = !DISubroutineType(types: !121)
!121 = !{!21, !122, !113}
!122 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!125 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !126, file: !32, line: 148)
!126 = !DISubprogram(name: "fwide", scope: !38, file: !38, line: 573, type: !127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!127 = !DISubroutineType(types: !128)
!128 = !{!21, !45, !21}
!129 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !130, file: !32, line: 149)
!130 = !DISubprogram(name: "fwprintf", scope: !38, file: !38, line: 580, type: !131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!131 = !DISubroutineType(types: !132)
!132 = !{!21, !113, !122, null}
!133 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !134, file: !32, line: 150)
!134 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !38, file: !38, line: 640, type: !131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!135 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !136, file: !32, line: 151)
!136 = !DISubprogram(name: "getwc", scope: !38, file: !38, line: 727, type: !43, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!137 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !138, file: !32, line: 152)
!138 = !DISubprogram(name: "getwchar", scope: !38, file: !38, line: 733, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!139 = !DISubroutineType(types: !140)
!140 = !{!34}
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !142, file: !32, line: 153)
!142 = !DISubprogram(name: "mbrlen", scope: !38, file: !38, line: 329, type: !143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!143 = !DISubroutineType(types: !144)
!144 = !{!98, !145, !98, !148}
!145 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!148 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !151, file: !32, line: 154)
!151 = !DISubprogram(name: "mbrtowc", scope: !38, file: !38, line: 296, type: !152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!152 = !DISubroutineType(types: !153)
!153 = !{!98, !112, !145, !98, !148}
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !155, file: !32, line: 155)
!155 = !DISubprogram(name: "mbsinit", scope: !38, file: !38, line: 292, type: !156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!156 = !DISubroutineType(types: !157)
!157 = !{!21, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !161, file: !32, line: 156)
!161 = !DISubprogram(name: "mbsrtowcs", scope: !38, file: !38, line: 337, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!162 = !DISubroutineType(types: !163)
!163 = !{!98, !112, !164, !98, !148}
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !167, file: !32, line: 157)
!167 = !DISubprogram(name: "putwc", scope: !38, file: !38, line: 741, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !169, file: !32, line: 158)
!169 = !DISubprogram(name: "putwchar", scope: !38, file: !38, line: 747, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!170 = !DISubroutineType(types: !171)
!171 = !{!34, !111}
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !173, file: !32, line: 160)
!173 = !DISubprogram(name: "swprintf", scope: !38, file: !38, line: 590, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!174 = !DISubroutineType(types: !175)
!175 = !{!21, !112, !98, !122, null}
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !177, file: !32, line: 162)
!177 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !38, file: !38, line: 647, type: !178, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{!21, !122, !122, null}
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !181, file: !32, line: 163)
!181 = !DISubprogram(name: "ungetwc", scope: !38, file: !38, line: 770, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{!34, !34, !45}
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !185, file: !32, line: 164)
!185 = !DISubprogram(name: "vfwprintf", scope: !38, file: !38, line: 598, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DISubroutineType(types: !187)
!187 = !{!21, !113, !122, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTS13__va_list_tag")
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !189, file: !8, baseType: !26, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !189, file: !8, baseType: !26, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !189, file: !8, baseType: !96, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !189, file: !8, baseType: !96, size: 64, offset: 128)
!195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !196, file: !32, line: 166)
!196 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !38, file: !38, line: 693, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !198, file: !32, line: 169)
!198 = !DISubprogram(name: "vswprintf", scope: !38, file: !38, line: 611, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DISubroutineType(types: !200)
!200 = !{!21, !112, !98, !122, !188}
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !202, file: !32, line: 172)
!202 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !38, file: !38, line: 700, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{!21, !122, !122, !188}
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !206, file: !32, line: 174)
!206 = !DISubprogram(name: "vwprintf", scope: !38, file: !38, line: 606, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!207 = !DISubroutineType(types: !208)
!208 = !{!21, !122, !188}
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !210, file: !32, line: 176)
!210 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !38, file: !38, line: 697, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !212, file: !32, line: 178)
!212 = !DISubprogram(name: "wcrtomb", scope: !38, file: !38, line: 301, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!213 = !DISubroutineType(types: !214)
!214 = !{!98, !215, !111, !148}
!215 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !53)
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !217, file: !32, line: 179)
!217 = !DISubprogram(name: "wcscat", scope: !38, file: !38, line: 97, type: !218, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!218 = !DISubroutineType(types: !219)
!219 = !{!110, !112, !122}
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !221, file: !32, line: 180)
!221 = !DISubprogram(name: "wcscmp", scope: !38, file: !38, line: 106, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubroutineType(types: !223)
!223 = !{!21, !123, !123}
!224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !225, file: !32, line: 181)
!225 = !DISubprogram(name: "wcscoll", scope: !38, file: !38, line: 131, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !227, file: !32, line: 182)
!227 = !DISubprogram(name: "wcscpy", scope: !38, file: !38, line: 87, type: !218, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !229, file: !32, line: 183)
!229 = !DISubprogram(name: "wcscspn", scope: !38, file: !38, line: 187, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!230 = !DISubroutineType(types: !231)
!231 = !{!98, !123, !123}
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !233, file: !32, line: 184)
!233 = !DISubprogram(name: "wcsftime", scope: !38, file: !38, line: 834, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DISubroutineType(types: !235)
!235 = !{!98, !112, !98, !122, !236}
!236 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !38, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !241, file: !32, line: 185)
!241 = !DISubprogram(name: "wcslen", scope: !38, file: !38, line: 222, type: !242, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!242 = !DISubroutineType(types: !243)
!243 = !{!98, !123}
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !245, file: !32, line: 186)
!245 = !DISubprogram(name: "wcsncat", scope: !38, file: !38, line: 101, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!246 = !DISubroutineType(types: !247)
!247 = !{!110, !112, !122, !98}
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !249, file: !32, line: 187)
!249 = !DISubprogram(name: "wcsncmp", scope: !38, file: !38, line: 109, type: !250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!250 = !DISubroutineType(types: !251)
!251 = !{!21, !123, !123, !98}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !253, file: !32, line: 188)
!253 = !DISubprogram(name: "wcsncpy", scope: !38, file: !38, line: 92, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !255, file: !32, line: 189)
!255 = !DISubprogram(name: "wcsrtombs", scope: !38, file: !38, line: 343, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!256 = !DISubroutineType(types: !257)
!257 = !{!98, !215, !258, !98, !148}
!258 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !261, file: !32, line: 190)
!261 = !DISubprogram(name: "wcsspn", scope: !38, file: !38, line: 191, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !263, file: !32, line: 191)
!263 = !DISubprogram(name: "wcstod", scope: !38, file: !38, line: 377, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!266, !122, !267}
!266 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!267 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !270, file: !32, line: 193)
!270 = !DISubprogram(name: "wcstof", scope: !38, file: !38, line: 382, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !122, !267}
!273 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !275, file: !32, line: 195)
!275 = !DISubprogram(name: "wcstok", scope: !38, file: !38, line: 217, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!276 = !DISubroutineType(types: !277)
!277 = !{!110, !112, !122, !267}
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !279, file: !32, line: 196)
!279 = !DISubprogram(name: "wcstol", scope: !38, file: !38, line: 428, type: !280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DISubroutineType(types: !281)
!281 = !{!74, !122, !267, !21}
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !283, file: !32, line: 197)
!283 = !DISubprogram(name: "wcstoul", scope: !38, file: !38, line: 433, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!284 = !DISubroutineType(types: !285)
!285 = !{!100, !122, !267, !21}
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !287, file: !32, line: 198)
!287 = !DISubprogram(name: "wcsxfrm", scope: !38, file: !38, line: 135, type: !288, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!288 = !DISubroutineType(types: !289)
!289 = !{!98, !112, !122, !98}
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !291, file: !32, line: 199)
!291 = !DISubprogram(name: "wctob", scope: !38, file: !38, line: 324, type: !292, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!292 = !DISubroutineType(types: !293)
!293 = !{!21, !34}
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !295, file: !32, line: 200)
!295 = !DISubprogram(name: "wmemcmp", scope: !38, file: !38, line: 258, type: !250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !297, file: !32, line: 201)
!297 = !DISubprogram(name: "wmemcpy", scope: !38, file: !38, line: 262, type: !246, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !299, file: !32, line: 202)
!299 = !DISubprogram(name: "wmemmove", scope: !38, file: !38, line: 267, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!300 = !DISubroutineType(types: !301)
!301 = !{!110, !110, !123, !98}
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !303, file: !32, line: 203)
!303 = !DISubprogram(name: "wmemset", scope: !38, file: !38, line: 271, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!110, !110, !111, !98}
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !307, file: !32, line: 204)
!307 = !DISubprogram(name: "wprintf", scope: !38, file: !38, line: 587, type: !308, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!308 = !DISubroutineType(types: !309)
!309 = !{!21, !122, null}
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !311, file: !32, line: 205)
!311 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !38, file: !38, line: 644, type: !308, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !313, file: !32, line: 206)
!313 = !DISubprogram(name: "wcschr", scope: !38, file: !38, line: 164, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{!110, !123, !111}
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !317, file: !32, line: 207)
!317 = !DISubprogram(name: "wcspbrk", scope: !38, file: !38, line: 201, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!318 = !DISubroutineType(types: !319)
!319 = !{!110, !123, !123}
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !321, file: !32, line: 208)
!321 = !DISubprogram(name: "wcsrchr", scope: !38, file: !38, line: 174, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !323, file: !32, line: 209)
!323 = !DISubprogram(name: "wcsstr", scope: !38, file: !38, line: 212, type: !318, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !32, line: 210)
!325 = !DISubprogram(name: "wmemchr", scope: !38, file: !38, line: 253, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!110, !123, !111, !98}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !330, file: !32, line: 251)
!329 = !DINamespace(name: "__gnu_cxx", scope: null)
!330 = !DISubprogram(name: "wcstold", scope: !38, file: !38, line: 384, type: !331, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !122, !267}
!333 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !335, file: !32, line: 260)
!335 = !DISubprogram(name: "wcstoll", scope: !38, file: !38, line: 441, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !122, !267, !21}
!338 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !340, file: !32, line: 261)
!340 = !DISubprogram(name: "wcstoull", scope: !38, file: !38, line: 448, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!341 = !DISubroutineType(types: !342)
!342 = !{!343, !122, !267, !21}
!343 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !330, file: !32, line: 267)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !335, file: !32, line: 268)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !340, file: !32, line: 269)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !270, file: !32, line: 283)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !196, file: !32, line: 286)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !202, file: !32, line: 289)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !210, file: !32, line: 292)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !330, file: !32, line: 296)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !335, file: !32, line: 297)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !340, file: !32, line: 298)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !355, file: !356, line: 58)
!355 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !357, file: !356, line: 80, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!356 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/exception_ptr.h", directory: "")
!357 = !DINamespace(name: "__exception_ptr", scope: !2)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !357, entity: !359, file: !356, line: 74)
!359 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !356, line: 70, type: !360, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !355}
!362 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !363, entity: !364, file: !365, line: 58)
!363 = !DINamespace(name: "__gnu_debug", scope: null)
!364 = !DINamespace(name: "__debug", scope: !2)
!365 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !367, file: !370, line: 47)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !368, line: 24, baseType: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !73, line: 37, baseType: !78)
!370 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdint", directory: "")
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !372, file: !370, line: 48)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !368, line: 25, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !73, line: 39, baseType: !374)
!374 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !376, file: !370, line: 49)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !368, line: 26, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !73, line: 41, baseType: !21)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !379, file: !370, line: 50)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !368, line: 27, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !73, line: 44, baseType: !74)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !382, file: !370, line: 52)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !383, line: 58, baseType: !78)
!383 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !385, file: !370, line: 53)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !383, line: 60, baseType: !74)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !387, file: !370, line: 54)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !383, line: 61, baseType: !74)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !389, file: !370, line: 55)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !383, line: 62, baseType: !74)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !391, file: !370, line: 57)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !383, line: 43, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !73, line: 52, baseType: !369)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !394, file: !370, line: 58)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !383, line: 44, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !73, line: 54, baseType: !373)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !397, file: !370, line: 59)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !383, line: 45, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !73, line: 56, baseType: !377)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !400, file: !370, line: 60)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !383, line: 46, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !73, line: 58, baseType: !380)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !403, file: !370, line: 62)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !383, line: 101, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !73, line: 72, baseType: !74)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !406, file: !370, line: 63)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !383, line: 87, baseType: !74)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !408, file: !370, line: 65)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !409, line: 24, baseType: !410)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !73, line: 38, baseType: !10)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !412, file: !370, line: 66)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !409, line: 25, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !73, line: 40, baseType: !76)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !415, file: !370, line: 67)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !409, line: 26, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !73, line: 42, baseType: !26)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !418, file: !370, line: 68)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !409, line: 27, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !73, line: 45, baseType: !100)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !421, file: !370, line: 70)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !383, line: 71, baseType: !10)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !423, file: !370, line: 71)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !383, line: 73, baseType: !100)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !425, file: !370, line: 72)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !383, line: 74, baseType: !100)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !427, file: !370, line: 73)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !383, line: 75, baseType: !100)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !429, file: !370, line: 75)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !383, line: 49, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !73, line: 53, baseType: !410)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !432, file: !370, line: 76)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !383, line: 50, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !73, line: 55, baseType: !413)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !435, file: !370, line: 77)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !383, line: 51, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !73, line: 57, baseType: !416)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !438, file: !370, line: 78)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !383, line: 52, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !73, line: 59, baseType: !419)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !441, file: !370, line: 80)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !383, line: 102, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 73, baseType: !100)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !444, file: !370, line: 81)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !383, line: 90, baseType: !100)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !446, file: !448, line: 53)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !447, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!447 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!448 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/clocale", directory: "")
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !450, file: !448, line: 54)
!450 = !DISubprogram(name: "setlocale", scope: !447, file: !447, line: 122, type: !451, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!451 = !DISubroutineType(types: !452)
!452 = !{!53, !21, !146}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !454, file: !448, line: 55)
!454 = !DISubprogram(name: "localeconv", scope: !447, file: !447, line: 125, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubroutineType(types: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !459, file: !463, line: 64)
!459 = !DISubprogram(name: "isalnum", scope: !460, file: !460, line: 108, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!460 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!461 = !DISubroutineType(types: !462)
!462 = !{!21, !21}
!463 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !465, file: !463, line: 65)
!465 = !DISubprogram(name: "isalpha", scope: !460, file: !460, line: 109, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !467, file: !463, line: 66)
!467 = !DISubprogram(name: "iscntrl", scope: !460, file: !460, line: 110, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !469, file: !463, line: 67)
!469 = !DISubprogram(name: "isdigit", scope: !460, file: !460, line: 111, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !471, file: !463, line: 68)
!471 = !DISubprogram(name: "isgraph", scope: !460, file: !460, line: 113, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !473, file: !463, line: 69)
!473 = !DISubprogram(name: "islower", scope: !460, file: !460, line: 112, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !475, file: !463, line: 70)
!475 = !DISubprogram(name: "isprint", scope: !460, file: !460, line: 114, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !477, file: !463, line: 71)
!477 = !DISubprogram(name: "ispunct", scope: !460, file: !460, line: 115, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !479, file: !463, line: 72)
!479 = !DISubprogram(name: "isspace", scope: !460, file: !460, line: 116, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !481, file: !463, line: 73)
!481 = !DISubprogram(name: "isupper", scope: !460, file: !460, line: 117, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !483, file: !463, line: 74)
!483 = !DISubprogram(name: "isxdigit", scope: !460, file: !460, line: 118, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !485, file: !463, line: 75)
!485 = !DISubprogram(name: "tolower", scope: !460, file: !460, line: 122, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !487, file: !463, line: 76)
!487 = !DISubprogram(name: "toupper", scope: !460, file: !460, line: 125, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !489, file: !463, line: 87)
!489 = !DISubprogram(name: "isblank", scope: !460, file: !460, line: 130, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !491, file: !493, line: 52)
!491 = !DISubprogram(name: "abs", scope: !492, file: !492, line: 840, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!493 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !495, file: !497, line: 127)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !492, line: 62, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!497 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !499, file: !497, line: 128)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !492, line: 70, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !501, identifier: "_ZTS6ldiv_t")
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !500, file: !492, line: 68, baseType: !74, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !500, file: !492, line: 69, baseType: !74, size: 64, offset: 64)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !505, file: !497, line: 130)
!505 = !DISubprogram(name: "abort", scope: !492, file: !492, line: 591, type: !506, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!506 = !DISubroutineType(types: !507)
!507 = !{null}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !509, file: !497, line: 134)
!509 = !DISubprogram(name: "atexit", scope: !492, file: !492, line: 595, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!510 = !DISubroutineType(types: !511)
!511 = !{!21, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !514, file: !497, line: 137)
!514 = !DISubprogram(name: "at_quick_exit", scope: !492, file: !492, line: 600, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !516, file: !497, line: 140)
!516 = !DISubprogram(name: "atof", scope: !517, file: !517, line: 25, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!518 = !DISubroutineType(types: !519)
!519 = !{!266, !146}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !521, file: !497, line: 141)
!521 = !DISubprogram(name: "atoi", scope: !492, file: !492, line: 361, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!522 = !DISubroutineType(types: !523)
!523 = !{!21, !146}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !525, file: !497, line: 142)
!525 = !DISubprogram(name: "atol", scope: !492, file: !492, line: 366, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!526 = !DISubroutineType(types: !527)
!527 = !{!74, !146}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !529, file: !497, line: 143)
!529 = !DISubprogram(name: "bsearch", scope: !530, file: !530, line: 20, type: !531, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!531 = !DISubroutineType(types: !532)
!532 = !{!96, !533, !533, !98, !98, !535}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !492, line: 808, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!21, !533, !533}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !540, file: !497, line: 144)
!540 = !DISubprogram(name: "calloc", scope: !492, file: !492, line: 542, type: !541, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubroutineType(types: !542)
!542 = !{!96, !98, !98}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !544, file: !497, line: 145)
!544 = !DISubprogram(name: "div", scope: !492, file: !492, line: 852, type: !545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DISubroutineType(types: !546)
!546 = !{!495, !21, !21}
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !548, file: !497, line: 146)
!548 = !DISubprogram(name: "exit", scope: !492, file: !492, line: 617, type: !549, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !21}
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !552, file: !497, line: 147)
!552 = !DISubprogram(name: "free", scope: !492, file: !492, line: 565, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !96}
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !556, file: !497, line: 148)
!556 = !DISubprogram(name: "getenv", scope: !492, file: !492, line: 634, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(types: !558)
!558 = !{!53, !146}
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !560, file: !497, line: 149)
!560 = !DISubprogram(name: "labs", scope: !492, file: !492, line: 841, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DISubroutineType(types: !562)
!562 = !{!74, !74}
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !564, file: !497, line: 150)
!564 = !DISubprogram(name: "ldiv", scope: !492, file: !492, line: 854, type: !565, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!565 = !DISubroutineType(types: !566)
!566 = !{!499, !74, !74}
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !568, file: !497, line: 151)
!568 = !DISubprogram(name: "malloc", scope: !492, file: !492, line: 539, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!569 = !DISubroutineType(types: !570)
!570 = !{!96, !98}
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !572, file: !497, line: 153)
!572 = !DISubprogram(name: "mblen", scope: !492, file: !492, line: 922, type: !573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!573 = !DISubroutineType(types: !574)
!574 = !{!21, !146, !98}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !576, file: !497, line: 154)
!576 = !DISubprogram(name: "mbstowcs", scope: !492, file: !492, line: 933, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubroutineType(types: !578)
!578 = !{!98, !112, !145, !98}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !580, file: !497, line: 155)
!580 = !DISubprogram(name: "mbtowc", scope: !492, file: !492, line: 925, type: !581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!581 = !DISubroutineType(types: !582)
!582 = !{!21, !112, !145, !98}
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !584, file: !497, line: 157)
!584 = !DISubprogram(name: "qsort", scope: !492, file: !492, line: 830, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !96, !98, !98, !535}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !588, file: !497, line: 160)
!588 = !DISubprogram(name: "quick_exit", scope: !492, file: !492, line: 623, type: !549, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !590, file: !497, line: 163)
!590 = !DISubprogram(name: "rand", scope: !492, file: !492, line: 453, type: !591, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!591 = !DISubroutineType(types: !592)
!592 = !{!21}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !594, file: !497, line: 164)
!594 = !DISubprogram(name: "realloc", scope: !492, file: !492, line: 550, type: !595, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!595 = !DISubroutineType(types: !596)
!596 = !{!96, !96, !98}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !598, file: !497, line: 165)
!598 = !DISubprogram(name: "srand", scope: !492, file: !492, line: 455, type: !599, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !26}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !602, file: !497, line: 166)
!602 = !DISubprogram(name: "strtod", scope: !492, file: !492, line: 117, type: !603, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!603 = !DISubroutineType(types: !604)
!604 = !{!266, !145, !605}
!605 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !608, file: !497, line: 167)
!608 = !DISubprogram(name: "strtol", scope: !492, file: !492, line: 176, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!609 = !DISubroutineType(types: !610)
!610 = !{!74, !145, !605, !21}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !612, file: !497, line: 168)
!612 = !DISubprogram(name: "strtoul", scope: !492, file: !492, line: 180, type: !613, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!613 = !DISubroutineType(types: !614)
!614 = !{!100, !145, !605, !21}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !616, file: !497, line: 169)
!616 = !DISubprogram(name: "system", scope: !492, file: !492, line: 784, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !618, file: !497, line: 171)
!618 = !DISubprogram(name: "wcstombs", scope: !492, file: !492, line: 936, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!619 = !DISubroutineType(types: !620)
!620 = !{!98, !215, !122, !98}
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !622, file: !497, line: 172)
!622 = !DISubprogram(name: "wctomb", scope: !492, file: !492, line: 929, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubroutineType(types: !624)
!624 = !{!21, !53, !111}
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !626, file: !497, line: 200)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !492, line: 80, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !628, identifier: "_ZTS7lldiv_t")
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !627, file: !492, line: 78, baseType: !338, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !627, file: !492, line: 79, baseType: !338, size: 64, offset: 64)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !632, file: !497, line: 206)
!632 = !DISubprogram(name: "_Exit", scope: !492, file: !492, line: 629, type: !549, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !634, file: !497, line: 210)
!634 = !DISubprogram(name: "llabs", scope: !492, file: !492, line: 844, type: !635, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!635 = !DISubroutineType(types: !636)
!636 = !{!338, !338}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !638, file: !497, line: 216)
!638 = !DISubprogram(name: "lldiv", scope: !492, file: !492, line: 858, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!639 = !DISubroutineType(types: !640)
!640 = !{!626, !338, !338}
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !642, file: !497, line: 227)
!642 = !DISubprogram(name: "atoll", scope: !492, file: !492, line: 373, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!643 = !DISubroutineType(types: !644)
!644 = !{!338, !146}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !646, file: !497, line: 228)
!646 = !DISubprogram(name: "strtoll", scope: !492, file: !492, line: 200, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!647 = !DISubroutineType(types: !648)
!648 = !{!338, !145, !605, !21}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !650, file: !497, line: 229)
!650 = !DISubprogram(name: "strtoull", scope: !492, file: !492, line: 205, type: !651, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!651 = !DISubroutineType(types: !652)
!652 = !{!343, !145, !605, !21}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !654, file: !497, line: 231)
!654 = !DISubprogram(name: "strtof", scope: !492, file: !492, line: 123, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!655 = !DISubroutineType(types: !656)
!656 = !{!273, !145, !605}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !329, entity: !658, file: !497, line: 232)
!658 = !DISubprogram(name: "strtold", scope: !492, file: !492, line: 126, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!659 = !DISubroutineType(types: !660)
!660 = !{!333, !145, !605}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !626, file: !497, line: 240)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !632, file: !497, line: 242)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !634, file: !497, line: 244)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !665, file: !497, line: 245)
!665 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !329, file: !497, line: 213, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !638, file: !497, line: 246)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !642, file: !497, line: 248)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !654, file: !497, line: 249)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !646, file: !497, line: 250)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !650, file: !497, line: 251)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !658, file: !497, line: 252)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !673, file: !675, line: 98)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !674, line: 7, baseType: !48)
